PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p18f66k40.inc
;----- TX1PPS Bits -----------------------------------------------------
TX1PPS0          EQU  H'0000'
TX1PPS1          EQU  H'0001'
TX1PPS2          EQU  H'0002'
TX1PPS3          EQU  H'0003'
TX1PPS4          EQU  H'0004'
TX1PPS5          EQU  H'0005'


;----- RX2PPS Bits -----------------------------------------------------
RX2PPS0          EQU  H'0000'
RX2PPS1          EQU  H'0001'
RX2PPS2          EQU  H'0002'
RX2PPS3          EQU  H'0003'
RX2PPS4          EQU  H'0004'
RX2PPS5          EQU  H'0005'


;----- TX2PPS Bits -----------------------------------------------------
TX2PPS0          EQU  H'0000'
TX2PPS1          EQU  H'0001'
TX2PPS2          EQU  H'0002'
TX2PPS3          EQU  H'0003'
TX2PPS4          EQU  H'0004'
TX2PPS5          EQU  H'0005'


;----- RX3PPS Bits -----------------------------------------------------
RX3PPS0          EQU  H'0000'
RX3PPS1          EQU  H'0001'
RX3PPS2          EQU  H'0002'
RX3PPS3          EQU  H'0003'
RX3PPS4          EQU  H'0004'
RX3PPS5          EQU  H'0005'


;----- TX3PPS Bits -----------------------------------------------------
TX3PPS0          EQU  H'0000'
TX3PPS1          EQU  H'0001'
TX3PPS2          EQU  H'0002'
TX3PPS3          EQU  H'0003'
TX3PPS4          EQU  H'0004'
TX3PPS5          EQU  H'0005'


;----- RX4PPS Bits -----------------------------------------------------
RX4PPS0          EQU  H'0000'
RX4PPS1          EQU  H'0001'
RX4PPS2          EQU  H'0002'
RX4PPS3          EQU  H'0003'
RX4PPS4          EQU  H'0004'
RX4PPS5          EQU  H'0005'


;----- TX4PPS Bits -----------------------------------------------------
TX4PPS0          EQU  H'0000'
TX4PPS1          EQU  H'0001'
TX4PPS2          EQU  H'0002'
TX4PPS3          EQU  H'0003'
TX4PPS4          EQU  H'0004'
TX4PPS5          EQU  H'0005'


;----- RX5PPS Bits -----------------------------------------------------
RX5PPS0          EQU  H'0000'
RX5PPS1          EQU  H'0001'
RX5PPS2          EQU  H'0002'
RX5PPS3          EQU  H'0003'
RX5PPS4          EQU  H'0004'
RX5PPS5          EQU  H'0005'


;----- TX5PPS Bits -----------------------------------------------------
TX5PPS0          EQU  H'0000'
TX5PPS1          EQU  H'0001'
TX5PPS2          EQU  H'0002'
TX5PPS3          EQU  H'0003'
TX5PPS4          EQU  H'0004'
TX5PPS5          EQU  H'0005'


;----- SSP1CLKPPS Bits -----------------------------------------------------
SSP1CLKPPS0      EQU  H'0000'
SSP1CLKPPS1      EQU  H'0001'
SSP1CLKPPS2      EQU  H'0002'
SSP1CLKPPS3      EQU  H'0003'
SSP1CLKPPS4      EQU  H'0004'
SSP1CLKPPS5      EQU  H'0005'


;----- SSP1DATPPS Bits -----------------------------------------------------
SSP1DATPPS0      EQU  H'0000'
SSP1DATPPS1      EQU  H'0001'
SSP1DATPPS2      EQU  H'0002'
SSP1DATPPS3      EQU  H'0003'
SSP1DATPPS4      EQU  H'0004'
SSP1DATPPS5      EQU  H'0005'


;----- SSP1SSPPS Bits -----------------------------------------------------
SSP1SSPPS0       EQU  H'0000'
SSP1SSPPS1       EQU  H'0001'
SSP1SSPPS2       EQU  H'0002'
SSP1SSPPS3       EQU  H'0003'
SSP1SSPPS4       EQU  H'0004'
SSP1SSPPS5       EQU  H'0005'


;----- SSP2CLKPPS Bits -----------------------------------------------------
SSP2CLKPPS0      EQU  H'0000'
SSP2CLKPPS1      EQU  H'0001'
SSP2CLKPPS2      EQU  H'0002'
SSP2CLKPPS3      EQU  H'0003'
SSP2CLKPPS4      EQU  H'0004'
SSP2CLKPPS5      EQU  H'0005'


;----- SSP2DATPPS Bits -----------------------------------------------------
SSP2DATPPS0      EQU  H'0000'
SSP2DATPPS1      EQU  H'0001'
SSP2DATPPS2      EQU  H'0002'
SSP2DATPPS3      EQU  H'0003'
SSP2DATPPS4      EQU  H'0004'
SSP2DATPPS5      EQU  H'0005'


;----- SSP2SSPPS Bits -----------------------------------------------------
SSP2SSPPS0       EQU  H'0000'
SSP2SSPPS1       EQU  H'0001'
SSP2SSPPS2       EQU  H'0002'
SSP2SSPPS3       EQU  H'0003'
SSP2SSPPS4       EQU  H'0004'
SSP2SSPPS5       EQU  H'0005'


;----- IPR0 Bits -----------------------------------------------------
INT0IP           EQU  H'0000'
INT1IP           EQU  H'0001'
INT2IP           EQU  H'0002'
INT3IP           EQU  H'0003'
IOCIP            EQU  H'0004'
TMR0IP           EQU  H'0005'


;----- IPR1 Bits -----------------------------------------------------
ADIP             EQU  H'0000'
ADTIP            EQU  H'0001'
CSWIP            EQU  H'0006'
OSCFIP           EQU  H'0007'


;----- IPR2 Bits -----------------------------------------------------
C1IP             EQU  H'0000'
C2IP             EQU  H'0001'
C3IP             EQU  H'0002'
ZCDIP            EQU  H'0006'
HLVDIP           EQU  H'0007'


;----- IPR3 Bits -----------------------------------------------------
SSP1IP           EQU  H'0000'
BCL1IP           EQU  H'0001'
SSP2IP           EQU  H'0002'
BCL2IP           EQU  H'0003'
TX1IP            EQU  H'0004'
RC1IP            EQU  H'0005'
TX2IP            EQU  H'0006'
RC2IP            EQU  H'0007'


;----- IPR4 Bits -----------------------------------------------------
TX3IP            EQU  H'0000'
RC3IP            EQU  H'0001'
TX4IP            EQU  H'0002'
RC4IP            EQU  H'0003'
TX5IP            EQU  H'0004'
RC5IP            EQU  H'0005'


;----- IPR5 Bits -----------------------------------------------------
TMR1IP           EQU  H'0000'
TMR2IP           EQU  H'0001'
TMR3IP           EQU  H'0002'
TMR4IP           EQU  H'0003'
TMR5IP           EQU  H'0004'
TMR6IP           EQU  H'0005'
TMR7IP           EQU  H'0006'
TMR8IP           EQU  H'0007'


;----- IPR6 Bits -----------------------------------------------------
TMR1GIP          EQU  H'0000'
TMR3GIP          EQU  H'0001'
TMR5GIP          EQU  H'0002'
TMR7GIP          EQU  H'0003'


;----- IPR7 Bits -----------------------------------------------------
CCP1IP           EQU  H'0000'
CCP2IP           EQU  H'0001'
CCP3IP           EQU  H'0002'
CCP4IP           EQU  H'0003'
CCP5IP           EQU  H'0004'


;----- IPR8 Bits -----------------------------------------------------
CWG1IP           EQU  H'0000'
NVMIP            EQU  H'0005'
CRCIP            EQU  H'0006'
SCANIP           EQU  H'0007'


;----- IPR9 Bits -----------------------------------------------------
SMU1IP           EQU  H'0000'
SMU1PRAIP        EQU  H'0001'
SMU1PWAIP        EQU  H'0002'
SMU2IP           EQU  H'0003'
SMU2PRAIP        EQU  H'0004'
SMU2PWAIP        EQU  H'0005'


