PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p18f66k40.inc
;----- WDTPSU Bits -----------------------------------------------------
WDT16            EQU  H'0000'
WDT17            EQU  H'0001'
WDTSTATE         EQU  H'0002'
WDT18            EQU  H'0003'
WDT19            EQU  H'0004'
WDT20            EQU  H'0005'
WDT21            EQU  H'0006'
WDT22            EQU  H'0007'

PSCNT16          EQU  H'0000'
PSCNT17          EQU  H'0001'
PSCNT18          EQU  H'0002'
PSCNT19          EQU  H'0003'
PSCNT20          EQU  H'0004'
PSCNT21          EQU  H'0005'
PSCNT22          EQU  H'0006'


WDTPSCNT16       EQU  H'0000'
WDTPSCNT17       EQU  H'0001'
WDTPSCNT18       EQU  H'0002'
WDTPSCNT19       EQU  H'0003'
WDTPSCNT20       EQU  H'0004'
WDTPSCNT21       EQU  H'0005'
WDTPSCNT22       EQU  H'0006'


;----- WDTU Bits -----------------------------------------------------
WDT16            EQU  H'0000'
WDT17            EQU  H'0001'
WDTSTATE         EQU  H'0002'
WDT18            EQU  H'0003'
WDT19            EQU  H'0004'
WDT20            EQU  H'0005'
WDT21            EQU  H'0006'
WDT22            EQU  H'0007'

PSCNT16          EQU  H'0000'
PSCNT17          EQU  H'0001'
PSCNT18          EQU  H'0002'
PSCNT19          EQU  H'0003'
PSCNT20          EQU  H'0004'
PSCNT21          EQU  H'0005'
PSCNT22          EQU  H'0006'


WDTPSCNT16       EQU  H'0000'
WDTPSCNT17       EQU  H'0001'
WDTPSCNT18       EQU  H'0002'
WDTPSCNT19       EQU  H'0003'
WDTPSCNT20       EQU  H'0004'
WDTPSCNT21       EQU  H'0005'
WDTPSCNT22       EQU  H'0006'


;----- CPUDOZE Bits -----------------------------------------------------
DOE              EQU  H'0004'
ROI              EQU  H'0005'
DOZEN            EQU  H'0006'
IDLEN            EQU  H'0007'

DOZE0            EQU  H'0000'
DOZE1            EQU  H'0001'
DOZE2            EQU  H'0002'


;----- OSCCON1 Bits -----------------------------------------------------
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'


;----- OSCCON2 Bits -----------------------------------------------------
CDIV0            EQU  H'0000'
CDIV1            EQU  H'0001'
CDIV2            EQU  H'0002'
CDIV3            EQU  H'0003'
COSC0            EQU  H'0004'
COSC1            EQU  H'0005'
COSC2            EQU  H'0006'


;----- OSCCON3 Bits -----------------------------------------------------
NOSCR            EQU  H'0003'
ORDY             EQU  H'0004'
SOSCPWR          EQU  H'0006'
CSWHOLD          EQU  H'0007'


;----- OSCSTAT Bits -----------------------------------------------------
PLLR             EQU  H'0000'
ADOR             EQU  H'0002'
SOR              EQU  H'0003'
LFOR             EQU  H'0004'
MFOR             EQU  H'0005'
HFOR             EQU  H'0006'
EXTOR            EQU  H'0007'


;----- OSCSTAT1 Bits -----------------------------------------------------
PLLR             EQU  H'0000'
ADOR             EQU  H'0002'
SOR              EQU  H'0003'
LFOR             EQU  H'0004'
MFOR             EQU  H'0005'
HFOR             EQU  H'0006'
EXTOR            EQU  H'0007'


;----- OSCEN Bits -----------------------------------------------------
ADOEN            EQU  H'0002'
SOSCEN           EQU  H'0003'
LFOEN            EQU  H'0004'
MFOEN            EQU  H'0005'
HFOEN            EQU  H'0006'
EXTOEN           EQU  H'0007'


;----- OSCTUNE Bits -----------------------------------------------------
TUN0             EQU  H'0000'
TUN1             EQU  H'0001'
TUN2             EQU  H'0002'
TUN3             EQU  H'0003'
TUN4             EQU  H'0004'
TUN5             EQU  H'0005'


;----- OSCFRQ Bits -----------------------------------------------------
FRQ0             EQU  H'0000'
FRQ1             EQU  H'0001'
FRQ2             EQU  H'0002'
FRQ3             EQU  H'0003'


;----- VREGCON Bits -----------------------------------------------------
VREGPM0          EQU  H'0000'
VREGPM1          EQU  H'0001'


;----- BORCON Bits -----------------------------------------------------
BORRDY           EQU  H'0000'
SBOREN           EQU  H'0007'


;----- PMD0 Bits -----------------------------------------------------
IOCMD            EQU  H'0000'
CLKRMD           EQU  H'0001'
NVMMD            EQU  H'0002'
SCANMD           EQU  H'0003'
CRCMD            EQU  H'0004'
HLVDMD           EQU  H'0005'
FVRMD            EQU  H'0006'
SYSCMD           EQU  H'0007'


;----- PMD1 Bits -----------------------------------------------------
TMR0MD           EQU  H'0000'
TMR1MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR3MD           EQU  H'0003'
TMR4MD           EQU  H'0004'
TMR5MD           EQU  H'0005'
TMR6MD           EQU  H'0006'
TMR7MD           EQU  H'0007'


;----- PMD2 Bits -----------------------------------------------------
TMR8MD           EQU  H'0000'
SMU1MD           EQU  H'0001'
SMU2MD           EQU  H'0002'
DSMMD            EQU  H'0003'
CWGMD            EQU  H'0005'

CWG1MD           EQU  H'0005'


;----- PMD3 Bits -----------------------------------------------------
ZCDMD            EQU  H'0000'
CMP1MD           EQU  H'0001'
CMP2MD           EQU  H'0002'
CMP3MD           EQU  H'0003'
ADCMD            EQU  H'0005'
DACMD            EQU  H'0006'


;----- PMD4 Bits -----------------------------------------------------
CCP1MD           EQU  H'0000'
CCP2MD           EQU  H'0001'
CCP3MD           EQU  H'0002'
CCP4MD           EQU  H'0003'
CCP5MD           EQU  H'0004'
PWM6MD           EQU  H'0005'
PWM7MD           EQU  H'0006'


;----- PMD5 Bits -----------------------------------------------------
MSSP1MD          EQU  H'0000'
MSSP2MD          EQU  H'0001'
UART1MD          EQU  H'0002'
UART2MD          EQU  H'0003'
UART3MD          EQU  H'0004'
UART4MD          EQU  H'0005'
UART5MD          EQU  H'0006'


;----- RA0PPS Bits -----------------------------------------------------
RA0PPS0          EQU  H'0000'
RA0PPS1          EQU  H'0001'
RA0PPS2          EQU  H'0002'
RA0PPS3          EQU  H'0003'
RA0PPS4          EQU  H'0004'
RA0PPS5          EQU  H'0005'


